app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE (user_id=NULL)
SELECT "microposts".* FROM "microposts"
---
  def index
      if params[:user_id]
        @microposts = Micropost.where("user_id=?",params[:user_id])
      else
        @microposts = Micropost.all

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "jjj"], ["user_id", 1], ["created_at", "2017-12-16 09:39:09.549018"], ["updated_at", "2017-12-16 09:39:09.549018"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "Mi primer post"], ["updated_at", "2017-12-16 10:20:46.229209"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @micropost.update(micropost_params)